artillery/get-reviews.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 200
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "./../csv_data/randomProductIds.csv"
    fields:
    - "product_id"

scenarios:
  - name: "Review meta + detail"
    flow:
      - get:
          url: "/reviews/meta"
          qs:
            product_id: "{{product_id}}"
      - get:
          url: "/reviews/"
          qs:
            product_id: "{{product_id}}"